package node

func TestStartNew() {
	/* Данный метод будет тесировать кейс создания новой сети.
	Создание новой сети подразумевает создания новой чистой базы данных 
	и далее начисления создателю пени. */
}

func TestStartConnect() {
	/* Данный метод будет проверять возможность создания новой ноды через 
	подключение к другим существующим нодам.
	Пока не трогать. */
}

func AcceptConnection() {
	/* Данная функция проверяет согласна ли она принять подключение от 
	запрашивающей ноды. Подключение будет приниматься в следующем кейсе:
	- Баланс запрашивающей ноды превышает 
	-
	-
	*/
}